/*
Завдання 1:
— Пароль і 4 спроби. Завдання виконуємо через while або do while.
1. Запросити у користувача пароль!
2. Якщо пароль не вірний повідомити що залишилось 4 спроби!
- якщо далі невірні паролі спроби зменшуються.
- коли спроб вже нема вивести повідомлення: "Будь ласка спробуйте пізніше!".
3. Якщо користувач одразу чи після кількох спроб ввів вірний пароль, вивести повідомлення "Запрошуємо на сайт!".
4. Завдання реалізуємо без break і міток!
*/
//Exercise_1

let ask = prompt("enter password");
let count = 5;
while (count > 1) {
    if (ask !== "qwerty") {
        count--;
        ask_2 = alert(`You have ${count} attempts`);
        ask = prompt("enter password");
    }
    else if (ask == "qwerty") {
        alert("welcome to website")
    };
};
alert("try again later");
/*
Завдання 2:
Переробити попередню домашню роботу за допомогою циклу while або do...while, а саме:
1. Створіть програму, яка обчислює факторіал натурального числа n, яке користувач введе з клавіатури.
2. Створіть програму, що виводить на екран всі чотиризначні числа послідовності 1000 1003 1006 1009 1012 1015 … 9999
3. Створіть програму, що виводить на екран перші 55 елементів послідовності 1 3 5 7 9 11 13 15 17 …
4. Створіть програму, що виводить на екран всі невід'ємні елементи послідовності 90 85 80 75 70 65 60 …
5. Створіть програму, що виводить на екран перші 20 елементів послідовності 2 4 8 16 32 64 128 …
6. Виведіть на екран всі числа в послідовності 2a-1(крок зміни лічильника), де початкове значення a = 2 та які менше 10000.
7. Виведіть на екран всі двозначні члени послідовності 2a+200(крок зміни лічильника), де початкове значення змінної a = -166.
8. Написати програму що обчислює піднесення до степеня. В 1й промпт вводиться число,а в 2й промпт степінь. Умови: Степінь може бути додатня, від'ємна або 0. Обрахувати всі можливі варіанти. Задачу бажано виконати використовуючи 1 цикл! 

a^b = a*a b раз;

a^-b= 1/a^b;

a^0 = 1;
*/
//Exercise_2.1
let n = prompt("Write number");
let res = 1;
let i = 1;
while (i < n) {
    i++;
    res = res *= i
};
console.log(res);

//Exercise_2.2
let j = 1000;
do {
    document.write(`<h2>number${j}</h2>`);
    j += 3;
}
while (j < 9999)

//Exercise_2.3
let c = 1;
let k = 0;
while (k < 55) {
    document.write(`<h2>number${c}</h2>`);
    k++;
    c += 2
};
//Exercise_2.4
let q = 90
while (q >= 0) {
    document.write(`<h2>number${q}</h2>`);
    q -= 5;
};

//Exercise_2.5
let w = 2;
let t = 1;
while (t <= 20) {
    document.write(`<h2>number${w}</h2>`);
    t++;
    let sum = w;
    w += sum;
};

//Exercise_2.6
let e = 2;
while (e < 10000) {
    document.write(`<h2>number${e}</h2>`)
    e = 2 * e - 1;
    console.log(`number is ${e}`)
}
//Exercise_2.7

let s = -166;
while (s < 99) {
    s = 2 * s + 200;
    if (s > -100 && (s < 100)) {
        console.log(s);
    }
}

//Exercise_2.8
let h = prompt("enter the first number");
let p = prompt("enter the second number");
let result = 1;
let b;
let l = 1;
if (p < 0) {
    b = -p;
}
else
    b = p;
while (l <= b) {
    result *= h;
    l++;
}
if (p <0) {
    result = 1 / result;
};
console.log(result);