
/*
Завдання 1:
— Створіть програму, яка обчислює факторіал натурального числа n, яке користувач введе з клавіатури.
*/
//Exercise_1

let n = prompt("Write number");
let res = 1;
for( i=1; i<=n; i++) {
    res= res*=i
};
console.log(res);
/*
Завдання 2:
— Створіть програму, що виводить на екран всі чотиризначні числа послідовності 1000 1003 1006 1009 1012 1015 … 9999
*/
//Exercise_2

for( i=1000; i<=9999; i+=3) {
    document.write(`<h2>number${i}</h2>`)
}
/*
Завдання 3:
— Створіть програму, що виводить на екран перші 55 елементів послідовності 1 3 5 7 9 11 13 15 17…
*/
//Exercise_3
for(i= 1, j=0; j<=55; i+=2, j++) {
    document.write(`<h2>number${i}</h2>`)
};
let n1 = 1;
let str1= " ";
for(i=1; i<55; i++) {
    n1+=2;
    str1 = str1 + n1 + ",";
}
    console.log(str1)
/*
Завдання 4:
— Створіть програму, що виводить на екран всі невід'ємні елементи послідовності 90 85 80 75 70 65 60…
*/
//Exercise_4
for(i=90; i>=0; i-=5) {
    document.write(`<h2>number${i}</h2>`)
};

/*
Завдання 5:
— Створіть програму, що виводить на екран перші 20 елементів послідовності 2 4 8 16 32 64 128…
*/
//Exercise_5
let str =" ";
for(i=2, n=0; n<20; i*=2,n++) {
   str = str + i + ", ";
};
console.log(str);
/*
Завдання 6:

— Виведіть на екран всі числа в послідовності 2a-1(крок зміни лічильника), де початкове значення a = 2 та які менше 10000.
*/
//Exercise_6
for(a=2; a<10000; a = 2*a-1){
    console.log(a);
}
/*
Завдання 7:
— Виведіть на екран всі двозначні члени послідовності 2a+200(крок зміни лічильника), де початкове значення змінної a = -166.
*/
//Exercise_7
for(i= -166; i<=99; i=2*i+200){
    if((i>-100) && (i<-9||i>9))
    {
        console.log(i);
    } 
    };
    /*
    Завдання 8:
— Написати програму що обчислює піднесення до степеня. В 1й промпт вводиться число,а в 2й промпт степінь. Умови: Степінь може бути додатня, від'ємна або 0. Обрахувати всі можливі варіанти циклом for. Задачу бажано виконати використовуючи 1 цикл! 
    */
//Exercise_8
let n_1 = +prompt("write number");
let n_2 = +prompt("write number");
let result = 1;
let c;
if(n_2 < 0){
     c = -n_2
    } else {
        c = n_2
    }
for (i = 1; i <= c; i++) {
    result *= n_1;
}
console.log(result)
if(n_2 < 0){
 result = 1/result;
 console.log(result)
} 
